#define LANGU    1

//#ifdef  LANGU 
//中文
char language[100][30] = {
"$$$",
/*1*/	"  欢迎使用",
/*2*/	"富怡喷墨切割机 ",
/*3*/	"普通设置",
/*4*/	"高级设置",
/*5*/	"自动开气泵:OFF",
/*6*/	"自动关气泵:OFF",
/*7*/	"自动开气泵:ON",
/*8*/	"自动关气泵:ON",
/*9*/	"    初始化中",

/*10*/	"    请稍后...",
/*11*/	"写入参数失败",
/*12*/	"请重试",
/*13*/	"自动送纸",
/*14*/	"进纸1/3",
/*15*/	"退纸1/3",
/*16*/	"进纸整幅",
/*17*/	"割完切断",
/*18*/	"测试图形打印",
/*19*/	"请稍后......",
/*20*/	"偏距设置:",
/*21*/	"切割速度设置:",
/*22*/	"低速",
/*23*/	"中速",
/*24*/	"高速",
/*25*/	"刀压设置: #",
/*26*/	"测试刀压",
/*27*/	"请稍后......",
//*28*/	"喷刀间距设置:",
//*29*/	"测试中",
/*28*/  "123456789",
/*29*/  "abcdefgab",

/*30*/	"机器类型设置",
/*31*/	"中高" ,
/*32*/	"中低" ,
/*33*/	"手动刀压测试" ,
/*34*/	"打印速度" ,
/*35*/	"移框速度" ,
/*36*/	"Ｚ轴驱动速度" ,
/*37*/	"提刀延时设置" ,
/*38*/  "落刀延时设置" ,
/*39*/  "删除当前任务否" ,
/*40*/  "回原点" ,
/*41*/	"定原点" ,
//*31*/	"Ｘ轴校正值" ,
//*32*/	"Ｙ轴校正值" ,
//*33*/	"测试框位置" ,
//*34*/	"左上角" ,
//*35*/	"左下角" ,
//*36*/	"右上角" ,
//*37*/	"右下角" ,
//*38*/	"ＸＹ校正值转换" ,
//*39*/	"ＸＹ校正测试" ,

//*40*/	"转角提刀延伸值" ,
//*41*/	"提刀延伸值" ,
/*42*/	"测试图形切割" ,
/*43*/	"  " ,
/*44*/	"按键提速比" ,
/*45*/	"测试图形切割" ,
/*46*/	"选择测试图比例" ,
/*47*/	"2*2cm" ,
/*48*/	"4*4cm" ,
/*49*/	"10*10cm" ,

/*50*/	"50*50cm" ,
/*51*/	"100*100cm" ,
/*52*/  "Ｙ轴移动超界!" ,
/*53*/	"正在执行喷绘" ,
/*54*/	"正在执行切割" ,
/*55*/  "删除当前任务否" ,
/*56*/	"1:删除  2:取消" ,
/*57*/	"喷头回原点" ,
/*58*/	"1:自动刀压测试" ,
/*59*/	"2:手动刀压测试" ,

/*60*/	"  " ,
/*61*/	"  " ,
/*62*/	"  " ,
/*63*/	"  " ,
/*64*/	"  " ,
/*65*/	"  " ,
/*66*/	"  " ,
/*67*/  "  " ,
/*68*/  "  " ,
/*69*/  "  " ,

/*70*/  "" ,
/*71*/  "是否自动切断纸" ,
/*72*/  "是" ,
/*73*/	"否" ,
/*74*/	"切断偏移距离" ,
/*75*/  ""
};
//#else
/*
//英文
char language[100][20] = {
" ",

};*/
//#endif




